---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamSourceUrl
source: html/e3d9bbc9-5f93-8bed-8dd1-32087c138617.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamSourceUrl Property

"Source URL"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialAssetParamSourceUrl { get; }
```